Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: གང་གིས་བར་སྣང་ལས་གླུ་དབྱངས་ཀྱི་སྒྲ་དག་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they hear melodies coming from the sky, consider those bodhisattvas to be on the sixth bhūmi.

source: གང་གིས་གདན་གྱི་སྟེང་ན་རིན་པོ་ཆེའི་དྲ་བས་ཡོངས་སུ་གཡོགས་པའི་གདུགས་དཀར་པོ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see a white parasol covered with a web of jewels above the seat, consider those bodhisattvas to be on the seventh bhūmi. 30.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་མཆོད་རྟེན་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །དེ་ནི་བྱང་ཆུབ་ཏུ་ཉེ་ཞིང་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བར་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas sees the parinirvāṇa stūpa, consider those bodhisattvas to be on one of the first eight bhūmis, to be close to awakening, and to have few karmic obscurations.

source: གང་གིས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རྡུལ་ཆགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they see the parinirvāṇa stūpa covered in dust, consider those bodhisattvas to be on the first bhūmi.

source: གང་གིས་རྡུལ་མེད་ཅིང་དག་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see it dust-free and clean, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་རྩྭའི་རིགས་འདྲེས་པ་དག་སྐྱེས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see different types of grass growing there, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་རྩྭ་སྔོན་པོ་དག་སྐྱེས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see green grass growing there, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་མེ་ཏོག་རྒྱས་པའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་བར་བལྟའོ། །
en: If they that it is surrounded by various trees with blooming flowers, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་མེ་ཏོག་དང་འབྲས་བུ་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see trees that are abundant with flowers and fruit, consider those bodhisattvas to be on the sixth bhūmi.

source: གང་གིས་བྱ་འདབ་ཆགས་སྣ་ཚོགས་དག་སྐད་འབྱིན་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །གང་གིས་རྒྱལ་མཚན་དང་། བླ་རེ་དང་། གདུགས་དག་གིས་བརྒྱན་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they see a variety of singing birds, consider those bodhisattvas to be on the seventh bhūmi. If they see that the stūpa is ornamented with banners, canopies, and parasols, consider those bodhisattvas to be on the eighth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 31. “Vajrapramardin, if in a dream bodhisattvas find the Tathāgata’s robe, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེས་ནི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ལ་མངོན་པར་བརྩོན་པས་ཡེ་ཤེས་ཡོངས་སུ་བཙལ་བར་བྱའོ། །
en: They should focus on recollecting the Buddha and thereby seek wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་ཏེ།
en: Such bodhisattvas have few karmic obscurations.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་དྲི་མ་ཅན་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they find a robe of the Tathāgata that is stained, consider those bodhisattvas to be on the first bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་དྲི་མ་མེད་པ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་གཉིས་པར་བལྟའོ། །
en: If they find a robe of the Tathāgata that is free of stains, consider those bodhisattvas to be on the second bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་ཚོན་གྱིས་བསྒྱུར་བ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་གསུམ་པར་བལྟའོ། །
en: If they find a robe of the Tathāgata that has been dyed, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་བཅགས་ཤིང་ཤིན་ཏུ་བྱི་དོར་བྱས་པ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་བཞི་པར་བལྟའོ། །
en: If they find a robe of the Tathāgata that is beaten and made exceedingly clean, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་འོད་དང་ལྡན་པ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་ལྔ་པར་བལྟའོ། །
en: If they find a robe of the Tathāgata that shines with light, consider those bodhisattvas to be on the fifth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་ཆོ་འཕྲུལ་བྱེད་པ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་དྲུག་པར་བལྟའོ། །
en: If they find a robe of the Tathāgata that works miracles, consider those bodhisattvas to be on the sixth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་གཅིག་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་བདུན་པར་བལྟའོ། །
en: If they find one piece of the Tathāgata’s robes, consider those bodhisattvas to be on the seventh bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་གསུམ་ཆར་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟ་སྟེ།
en: If they find the three pieces of the Tathāgata’s robes, consider those bodhisattvas to be on the eighth bhūmi.

source: གལ་ཏེ་བརྩོན་ན་ནི་མཚན་མ་དེ་དག་འབྱུང་བར་འགྱུར་རོ། །
en: If such bodhisattvas make an effort, these signs will arise.

source: ཇི་སྟེ་མི་བརྩོན་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་བདུད་ཀྱི་ལས་མ་གཏོགས་པར་ལས་དེ་མེད་དོ། །
en: If, however, they make no effort, the signs would not be attributable to the bodhisattvas but would be exclusively the activity of Māra. 32.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སངས་རྒྱས་རྣམས་ཀྱིས་དགོངས་པ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་བརྒྱད་པ་ལ་ཆོས་ཀྱི་སྣང་བའི་སྣོད་དུ་གྱུར་བར་འགྱུར་རོ། །
en: “Vajrapramardin, if in a dream bodhisattvas find the Tathāgata’s alms bowl, those bodhisattvas are in the thoughts of the buddhas, are on the eighth bhūmi, and will be vessels for the light of Dharma.

source: དེས་ཀྱང་སྒྲིབ་པ་མེད་པའི་བཟོད་པ་བསྒོམ་བར་བྱ་སྟེ། དེས་ན་དེ་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: They should also cultivate acceptance of the absence of obscuration and thereby find release in awakening.

source: གལ་ཏེ་ལྷུང་བཟེད་སྐྱོན་ཅན་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they find a flawed alms bowl, consider those bodhisattvas to be on the first bhūmi.

source: གལ་ཏེ་སྐྱོན་མེད་པ་སྟོང་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they find a flawless and empty alms bowl, consider those bodhisattvas to be on the second bhūmi.

source: གལ་ཏེ་རོ་ཞིམ་པོས་ཡོངས་སུ་གང་བ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they find one that is full of delicious flavors, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་མེ་ཏོག་དང་བཅས་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they find one with flowers, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་འབྲས་བུ་དང་བཅས་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they find one with fruit, consider those bodhisattvas to be on the fifth bhūmi.

source: གལ་ཏེ་ཁ་ཟས་དང་བཅས་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they find one with food, consider those bodhisattvas to be on the sixth bhūmi.

source: གལ་ཏེ་དྲིས་ཡོངས་སུ་གང་བ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they find one full of fragrances, consider those bodhisattvas to be on the seventh bhūmi.

source: གལ་ཏེ་མེ་ཏོག་ཕྲེང་གིས་དཀྲིས་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they find one wrapped with a flower garland, consider those bodhisattvas to be on the eighth bhūmi.

source: གལ་ཏེ་ཆོས་གོས་དང་བཅས་ཏེ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །
en: If they find one together with a robe, consider those bodhisattvas to be on the ninth bhūmi.

source: གལ་ཏེ་ནམ་མཁའ་ལས་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་བལྟའོ། །
en: If they find one that came from empty space, consider those bodhisattvas to be on the tenth bhūmi.

source: དེ་ལ་གང་རློམ་སེམས་མེད་པ་མ་གཏོགས་པར་བདུད་ཀྱི་ལས་ནི་རྟོགས་པར་བྱའོ། །
en: Unless these signs occur without conceit, they should be understood as the activity of Māra. 33.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཉག་གཅིག་མཐོང་ན་དེས་རབ་ཏུ་དབེན་པར་གནས་པར་བྱ་ཞིང་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ལ་ཡང་བརྩོན་པར་བྱ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata all alone, they should retire to solitude and diligently apply themselves to the samādhi of emptiness.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: Consider those bodhisattvas to be on the eighth bhūmi.

source: དེས་ནི་ལས་ཀྱི་སྒྲིབ་པ་སྦྱང་བའི་ཕྱིར་བསམ་པ་རྣམ་པར་དག་པས་རབ་ཏུ་བརྩོན་པར་བྱ་སྟེ།
en: Such bodhisattvas should exert themselves to purify their karmic obscurations with pure intentions.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་སྐྱེ་བོ་མང་པོས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་དེས་སྐྱེ་བོ་མང་པོ་བསྡུ་ཞིང་ཉོན་མོངས་པ་བཟོད་པར་བྱའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata surrounded by many people, such bodhisattvas should bring many people together and be patient with their afflictions.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: Consider those bodhisattvas to be on one of the ten bhūmis.

source: བྱང་ཆུབ་ནི་བརྩོན་འགྲུས་ལ་རག་ལས་པ་ཡིན་ནོ། །
en: Awakening depends on diligence.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དམངས་རིགས་དང་རྗེའུ་རིགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see the Tathāgata surrounded by śūdras and vaiśyas, consider them to be on the first bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་རྒྱལ་རིགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see the Tathāgata surrounded by kṣatriyas, consider those bodhisattvas to be on the second bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་བྲམ་ཟེས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see the Tathāgata surrounded by brahmins, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་རྒྱལ་པོ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see the Tathāgata surrounded by kings, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཀླུ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see the Tathāgata surrounded by nāgas, consider those bodhisattvas to be on the fifth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་རྒྱལ་པོ་ཆེན་པོ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see the Tathāgata surrounded by great kings, consider those bodhisattvas to be on the sixth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་བརྒྱ་བྱིན་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see the Tathāgata surrounded by numerous Śakras, consider those bodhisattvas to be on the seventh bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཚངས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they see the Tathāgata surrounded by numerous Brahmās, consider those bodhisattvas to be on the eighth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །
en: If they see the Tathāgata surrounded by the gods of the Pure Abodes, consider those bodhisattvas to be on the ninth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ།
en: If they see the Tathāgata surrounded by bodhisattvas, consider those bodhisattvas to be on the tenth bhūmi.

source: བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ།། །།
en: These are the signs, unless they are the activity of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དགུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 35. “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata’s parasol, consider those bodhisattvas to be on one of the first nine bhūmis.

source: བདུད་ཀྱི་ལས་མ་གཏོགས་པར་ལས་ཀྱི་སྒྲིབ་པ་ནི་ཡོད་དོ། །གལ་ཏེ་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་དགའ་བར་མི་བྱེད་ན་མྱུར་བར་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: Unless it is the activity of Māra, such bodhisattvas have karmic obscurations. If they do not take pleasure in gain, honor, or praise, those bodhisattvas will quickly find release in awakening.

source: གལ་ཏེ་ལོ་མའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they see a parasol made of leaves, consider those bodhisattvas to be on the first bhūmi.

source: གལ་ཏེ་འོད་མའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see a parasol made of bamboo, consider those bodhisattvas to be on the second bhūmi.

source: གལ་ཏེ་གྲོ་བའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see a parasol made of birch, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་ཤིང་གི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see a parasol made of wood, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་ཤིང་འདབ་ཀྱི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see a parasol of leafy branches, consider those bodhisattvas to be on the fifth bhūmi.

source: གལ་ཏེ་ལྕགས་ཀྱི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see an iron parasol, consider those bodhisattvas to be on the sixth bhūmi.

source: གལ་ཏེ་གསེར་གྱི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see a golden parasol, consider those bodhisattvas to be on the seventh bhūmi.

source: གལ་ཏེ་རིན་པོ་ཆེའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they see a jeweled parasol, consider those bodhisattvas to be on the eighth bhūmi.

source: གལ་ཏེ་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་སྤྱངས་པའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟ་སྟེ།
en: If they see a parasol strung with a web of small bells, consider those bodhisattvas to be on the ninth bhūmi.

source: ས་དྲུག་པོ་དག་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་རྟོགས་པར་བྱའོ། །
en: Up to the sixth bhūmi, understand that these signs might also be the activity of Māra. 36.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་ཆགས་དག་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas see a place visited by the Tathāgata, consider those bodhisattvas to be on one of the first ten bhūmis.

source: དེས་བརྩོན་འགྲུས་བརྩམས་ན་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ།
en: Such bodhisattvas will find release if they sustain their diligence.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལུང་བསྟན་པ་ཡིན་པར་གཟུང་ཞིང་ལུང་བསྟན་པའི་མཚམས་བཅད་པ་ཡིན་ནོ། །
en: Those bodhisattvas are predicted, and the terms of those predictions are fixed.

source: གལ་ཏེ་ཁྱིམ་དུ་ཆགས་དག་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བར་བལྟའོ། །
en: “If those bodhisattvas see the Tathāgata visiting a house, consider those bodhisattvas to be on the first bhūmi.

source: གལ་ཏེ་སྒོ་ན་འདུག་སྟེ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see him in a doorway, consider those bodhisattvas to be on the second bhūmi.

source: གལ་ཏེ་སྐྱེད་མོས་ཚལ་ན་འདུག་སྟེ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see him in a garden, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་འཆག་སྟེ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see the Tathāgata walking, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་གནས་ཁང་ན་འདུག་སྟེ། མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see him in a dwelling, consider those bodhisattvas to be on the fifth bhūmi.

source: གལ་ཏེ་སྙོམས་པར་ཞུགས་པ་ན་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see him in meditative composure, consider those bodhisattvas to be on the sixth bhūmi.

source: གལ་ཏེ་ཆུ་ཀླུང་གི་ནང་དུ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see him in a river, consider those bodhisattvas to be on the seventh bhūmi.

source: གལ་ཏེ་རི་ལ་འདུག་སྟེ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they see him on a mountain, consider those bodhisattvas to be on the eighth bhūmi.

source: གལ་ཏེ་ནམ་མཁའ་ལ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །
en: If they see him in the sky, consider those bodhisattvas to be on the ninth bhūmi.

source: གལ་ཏེ་ཆོ་འཕྲུལ་མཛད་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ།
en: If they see him performing miracles, consider those bodhisattvas to be on the tenth bhūmi.

source: བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །
en: These are the signs, unless they are the activity of Māra. 37.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་གདན་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata’s seat, consider those bodhisattvas to be on one of the first six bhūmis.

source: དེས་རབ་ཏུ་ཞི་བ་ལ་མངོན་པར་དགའ་བར་བྱའོ། །
en: They should take joy in tranquility.

source: དེས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ།
en: They will find release in awakening through it.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་ནོ། །
en: Such bodhisattvas have few karmic obscurations.

source: གང་གིས་གདན་ལེགས་པར་མ་བྱས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see a seat that is not well made, consider those bodhisattvas to be on the first bhūmi.

source: གང་གིས་གདན་ལེགས་པར་བྱས་པ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see a seat that is well made, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་གདན་བྱི་དོར་བྱས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see a seat that has been cleaned, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་གདན་ཁྲ་བོ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see a multicolored seat, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་གདན་བཤམས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see an arranged seat, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་གདན་ལེགས་པར་བཤམས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟ་སྟེ།
en: If they see a seat that has been well arranged, consider those bodhisattvas to be on the sixth bhūmi.

source: བདུད་ཀྱི་ལས་ཀྱང་རྟོགས་པར་བྱའོ། །
en: These are the signs, unless they are the activity of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ཞལ་ཟས་འབུལ་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟའོ། །
en: 38. “Vajrapramardin, if in a dream bodhisattvas perceive themselves offering food to the Tathāgata, consider those bodhisattvas to be on one of the first seven bhūmis.

source: གལ་ཏེ་དེས་བརྩོན་འགྲུས་བྱས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་ནོ། །
en: If they sustain their diligence, they will find release in awakening, but such bodhisattvas have minor karmic obscurations.

source: གང་དེ་བཞིན་གཤེགས་པ་གྲོང་དུ་གཤེགས་ཤིང་བཞེངས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they offer alms to the Tathāgata after he has arrived in or departed a city, consider those bodhisattvas to be on the first bhūmi.

source: གང་དེ་བཞིན་གཤེགས་པ་གྲོང་ན་བཞུགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they offer alms to the Tathāgata while he resides in a city, consider those bodhisattvas to be on the second bhūmi.

source: གང་དེ་བཞིན་གཤེགས་པ་སྒོར་གཤེགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they offer alms to the Tathāgata when he reaches a door, consider those bodhisattvas to be on the third bhūmi.

source: གང་དེ་བཞིན་གཤེགས་པ་སྲང་དུ་གཤེགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they offer the Tathāgata alms when he is walking the streets, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་དེ་བཞིན་གཤེགས་པ་གྲོང་ཁྱེར་གྱི་སྒོར་གཤེགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they offer alms to the Tathāgata when he has reached the city gates, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་དེ་བཞིན་གཤེགས་པ་དགོན་པ་ན་བཞུགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they offer alms to the Tathāgata while he is residing in the wilderness, consider those bodhisattvas to be on the sixth bhūmi.

source: གང་དེ་བཞིན་གཤེགས་པ་གཙུག་ལག་ཁང་དུ་གཤེགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they offer alms to the Tathāgata when he has reached a monastery, consider those bodhisattvas to be on the seventh bhūmi. 39.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་འབུལ་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves offering clothes to the Tathāgata, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེས་ནི་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་བརྩོན་པར་བྱ་སྟེ། དེས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: Such bodhisattvas should endeavor in the samādhi of signlessness, and thereby find release in awakening.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་གུས་པར་བྱས་ཏེ་ན་བཟའ་འབུལ་བར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they respectfully offer clothes to the Tathāgata, consider those bodhisattvas to be on the first bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་དཀར་པོ་འབུལ་བར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they offer the Tathāgata white clothes, consider those bodhisattvas to be on the second bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་དམར་པོ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they offer the Tathāgata red clothes, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་ཁྲ་བོ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they offer the Tathāgata multicolored clothes, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they offer the Tathāgata clothes of a golden color, consider those bodhisattvas to be on the fifth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་རིན་པོ་ཆེས་སྤྲས་པ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they offer the Tathāgata clothes decorated with jewels, consider those bodhisattvas to be on the sixth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་ཚོན་གྱིས་བྲིས་པ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they offer the Tathāgata clothes with colored patterns, consider those bodhisattvas to be on the seventh bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་འོད་ཆགས་པ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they offer the Tathāgata radiant clothes, consider those bodhisattvas to be on the eighth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་དག་འབུལ་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 40. “Vajrapramardin, if in a dream bodhisattvas perceive themselves offering flowers to the Tathāgata, consider those bodhisattvas to be on one of the first six bhūmis.

source: གང་ཟག་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆེ་ཞིང་ལུང་མནོད་པ་ལ་བརྩོན་ཡང་ཚེགས་ཆེན་པོས་སྣང་བར་འགྱུར་རོ། །
en: Such individuals have major karmic obscurations, and though they will make an effort to receive a prediction, it will appear only through much toil.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་རྙིས་པ་དག་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If such bodhisattvas offer the Tathāgata withered flowers, consider those bodhisattvas to be on the first bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་སར་པ་དག་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they offer the Tathāgata fresh flowers, consider those bodhisattvas to be on the second bhūmi.
